//
//  HelpViewController.swift
//  FWSideMenu
//
//  Created by wanglab on 2020/12/13.
//  Copyright © 2020 xfg. All rights reserved.
//

import Foundation




//String str1 = "<p><B>1.我该如何使用这个App？</B><br/>" +
//                "打开APP后，同意使用协议，选择传食物界面，点击拍照或者选择图片按钮，根据提示赋予所需的手机存储与使用相机权限。使用APP对食物进行拍照，或选择手机内的食物图片后点击上传按钮。APP会将当前图片上传到服务器进行分析判断是否是食物，并返回近三个月内的用户饮食规律和当前时间之后的24小时内用户的饮食时间建议。</p>";
//
//        String  str2 = "<p><B>2.这个App有哪些功能？</B><br/>" +
//                "本应用目前主要是通过用户上传的食物图片，推断出用户的饮食规律，并给出合理的饮食建议，比如当前时间之后的24小时内用户的饮食时间建议。" +
//                "同时本应用还可以记录用户的基本信息如身高、体重、睡眠时间等数据。</p>";
//        String str3 = "<p><B>3.我忘记按时上传食物图片了怎么办？</B><br/>" +
//                "如果忘记上传数据，可以点击更新按钮，进入补传数据页面，选择食物的图片，然后选择当天进食的时间点，注意是只能补传当天忘记的食物的图片，然后选中图片，点击上传，那么补传就完成了。" +
//                "</p>";
//        String str4 = "<p><B>4.我没有上传食物图片可以么？</B><br/>" +
//                "本应用会使用深度学习算法判断上传的图片是否是食物，如果上传非食物图片并不会被记录到用户的饮食规律中。本应用也可以选择手动上传功能，可以不上传图片" +
//                "</p>";
//        String str5 = "<p><B>5.注册账号有什么用处？</B><br/>" +
//                "注册账号后在您更换手机后可以同步之前手机所记录的饮食规律，这样有利于给出您更合理的饮食建议。" +
//                "</p>";
